package dy1018;
/*
 * 컴파일 오류 : 문법에 맞지 않게 작성된 코드 = 컴파일 할 때 발견
 * 
 * 예외(Exception)
 * 1. 오동작이나 결과에 악영향을 미칠 수 있는 실행 중 발생한 오류
 *  - 정수 입력을 기다리는 코드가 실행되고 있을 때, 문자가 입력된 경우
 *  - 정수를 0으로 나누는 경우
 *  - 배열보다 큰 인덱스로 배열의 원소를 접근하는 경우
 *  - 존재하지 않는 파일을 읽으려고 하는 경우
 *  
 * 2.  자바에서 예외처리 가능
 *  - 예외 발생 -> 자바 플랫폼 인지 -> 응용 프로그램에서 전달
 * *
 */
public class Ex_01 {
	public static void main(String[] args) {
//		try { // 예외가 발생할 가능성이 있는 실행문
//			
//		} catch{  //처리할 예외 타입 선언
//			
//		} finally { //finally 블록 문 - 예외 여부와 상관없이 무조건 실행
//			
//		}
	}
}
